---
kind: other
id: AllMembers.T:Autodesk.Revit.Exceptions.ArgumentException
source: html/9d7b0846-dcfa-2a3e-0d53-2e7197d06bc7.htm
---
# ArgumentException Members

Retrieves data needed to serialize the target object.